Revit 2027 API
BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurve Property
 Cannot add the direction curve in the floor sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorCannotAddDirectionCurve { get; }
Public Shared ReadOnly Property FloorCannotAddDirectionCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurve {
	FailureDefinitionId^ get ();
}
static member FloorCannotAddDirectionCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace